# задание 1
# n_list = input("Введите список чисел, разделенных пробелами: ").split()
# stepen = int(input("Введите степень: "))
# result = [float(item) ** stepen for item in n_list]
# print(result)

# задание 2
# u_input = input("Введите строку: ").lower()
# c_count = {}
# for char in u_input:
#     if char != " ":
#         if char in c_count:
#             c_count[char] += 1
#         else:
#             c_count[char] = 1
# print(c_count)

# задание 3
# dct = {1: 11, 2: 22, 3: 33, 4: 4, 5: 33, 6: 1}
# keys = {k for k in dct.keys()}
# values = {v for v in dct.values()}
# combo = keys | values
# print("Объединенные множества:", combo)
# print(keys)
# print(values)

# задание 1*
# data = {
#     "Имя": ["Андрей", "Кирилл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Аркадий", "Игорь", "Кирилл"],
#     "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Лихачев", "Никитин", "Левашев"],
#     "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Москва", "Псков", "Москва", "Омск", "Псков", "Москва"],
#     "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1957, 1969, 1999],
#     "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 2, 3, 6],
#     "Число рождения": [11, 25, 5, 3, 27, 31, 13, 12, 28, 24],
#     "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Студент", "Работает", "Пенсия", "Работает", "Студент"]
# }

# for i in range(len(data["Имя"])):
#     if data["Имя"][i] == "Кирилл":
#         data["Имя"][i] = "Кириллл"

# for i in range(len(data["Фамилия"])):
#     if data["Фамилия"][i] == "Никитин" and data["Город проживания"][i] == "Москва":
#         data["Город проживания"][i] = "Махачкала"

# for i in range(len(data["Фамилия"])):
#     if data["Фамилия"][i] == "Лихачев" and data["Имя"][i] == "Аркадий":
#         for key in data:
#             del data[key][i]
#         break

# updated = {}
# for имя, фамилия, год, месяц, день, город, статус in zip(data["Имя"], data["Фамилия"], data["Год рождения"],
#                                                            data["Месяц рождения"], data["Число рождения"],
#                                                            data["Город проживания"], data["Статус"]):
#     f_name = f"{фамилия} {имя}"
#     birth_date = f"{год}-{месяц:02d}-{день:02d}"
#     updated[f_name] = {
#         "Дата рождения": birth_date,
#         "Город проживания": город,
#         "Статус": статус
#     }
# print(updated)


# задание 2*
# set1 = {6, 31, 14, 25, 19, 3, 55}
# set2 = {30, 22, 6, 79, 25}
# set3 = {9, 1, 22, 19, 30}
# list1 = list(set1)
# list2 = list(set2)
# list3 = list(set3)

# comb_list = list1 + list2 + list3
# comb_set = set1 | set2 | set3

# miss_el = [el for el in comb_list if el not in comb_set]
# # я слегка не понял задание, потому что все элементы из множеств сохранились,
# # просто пропали повторы, следовательно список будет пуст
# set_list = list(comb_set)
# diff = []
# for el in comb_list:
#     if el in set_list and el not in diff:
#         diff.append(el)

# print("Объединенный список:", comb_list)
# print("Объединенное множество:", comb_set)
# print("Элементы, не вошедшие в объединенное множество:", miss_el)
# print("Разница между объединенным множеством и списком отсутствующих элементов:", diff)
